# Installing our database connector.

- Magic command to enable us to run sql commands within a jupyter notebook

In [ ]:
%load_ext sql

- Magic command to run one line of sql

In [ ]:
%sql

- Magic command to run multiple lines of sql

In [ ]:
%%sql

- Connecting to a sqlite database available locally

In [ ]:
%sql sqlite:///chinook.db

# **Explore the database**

- Selecting all table names from our database.

In [ ]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]

- Looking into a particular table within our database

In [ ]:
%sql PRAGMA table_info(employees);

 * sqlite:///chinook.db
Done.

[(0, 'EmployeeId', 'INTEGER', 1, None, 1),
 (1, 'LastName', 'NVARCHAR(20)', 1, None, 0),
 (2, 'FirstName', 'NVARCHAR(20)', 1, None, 0),
 (3, 'Title', 'NVARCHAR(30)', 0, None, 0),
 (4, 'ReportsTo', 'INTEGER', 0, None, 0),
 (5, 'BirthDate', 'DATETIME', 0, None, 0),
 (6, 'HireDate', 'DATETIME', 0, None, 0),
 (7, 'Address', 'NVARCHAR(70)', 0, None, 0),
 (8, 'City', 'NVARCHAR(40)', 0, None, 0),
 (9, 'State', 'NVARCHAR(40)', 0, None, 0),
 (10, 'Country', 'NVARCHAR(40)', 0, None, 0),
 (11, 'PostalCode', 'NVARCHAR(10)', 0, None, 0),
 (12, 'Phone', 'NVARCHAR(24)', 0, None, 0),
 (13, 'Fax', 'NVARCHAR(24)', 0, None, 0),
 (14, 'Email', 'NVARCHAR(60)', 0, None, 0)]

In [ ]:
%sql PRAGMA table_info(albums);

 * sqlite:///chinook.db
Done.

[(0, 'AlbumId', 'INTEGER', 1, None, 1),
 (1, 'Title', 'NVARCHAR(160)', 1, None, 0),
 (2, 'ArtistId', 'INTEGER', 1, None, 0)]

In [ ]:
%sql SELECT COUNT(*) FROM employees;

 * sqlite:///chinook.db
Done.

[(8,)]

In [ ]:
%sql SELECT LastName FROM employees;

 * sqlite:///chinook.db
Done.

[('Adams',),
 ('Edwards',),
 ('Peacock',),
 ('Park',),
 ('Johnson',),
 ('Mitchell',),
 ('King',),
 ('Callahan',)]

In [ ]:
%sql SELECT * FROM employees LIMIT 2;

 * sqlite:///chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com')]

In [ ]:
%sql SELECT Title FROM employees LIMIT 5;

 * sqlite:///chinook.db
Done.

[('General Manager',),
 ('Sales Manager',),
 ('Sales Support Agent',),
 ('Sales Support Agent',),
 ('Sales Support Agent',)]

In [ ]:
%sql SELECT * FROM albums LIMIT 5;

 * sqlite:///chinook.db
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]

In [ ]:
%sql SELECT Title FROM albums WHERE ArtistId == 1;

 * sqlite:///chinook.db
Done.

[('For Those About To Rock We Salute You',), ('Let There Be Rock',)]

# **Creating and Deleting Tables**

- We'll create a table named 'Worker' in our database.
- We'll include a constraint in some of the fields for data intergrity.
- We'll specify the data type to be stored in each field.

In [ ]:
%%sql CREATE TABLE Worker(
    last_name VARCHAR(25),
    worker_id INT NOT NULL PRIMARY KEY,
    first_name VARCHAR(25),
    salary INT(15),
    department VARCHAR(25)
);

 * sqlite:///chinook.db
Done.

[]

- Confirm creation of the table

In [ ]:
%sql SELECT name FROM sqlite_master WHERE type=='table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',),
 ('Worker',)]

In [ ]:
%sql PRAGMA table_info("Worker");

 * sqlite:///chinook.db
Done.

[(0, 'last_name', 'VARCHAR(25)', 0, None, 0),
 (1, 'worker_id', 'INT', 1, None, 1),
 (2, 'first_name', 'VARCHAR(25)', 0, None, 0),
 (3, 'salary', 'INT(15)', 0, None, 0),
 (4, 'department', 'VARCHAR(25)', 0, None, 0)]

In [ ]:
%sql PRAGMA table_info("Worker");

 * sqlite:///chinook.db
Done.

[(0, 'last_name', 'VARCHAR(25)', 0, None, 0),
 (1, 'worker_id', 'INT', 1, None, 1),
 (2, 'first_name', 'VARCHAR(25)', 0, None, 0),
 (3, 'salary', 'INT(15)', 0, None, 0),
 (4, 'department', 'VARCHAR(25)', 0, None, 0)]

In [ ]:
%%sql CREATE TABLE Supervisor(
    first_name VARCHAR(20),
    last_name VARCHAR(25),
    worker_id INT NOT NULL PRIMARY KEY,
    salary INT(15),
    department VARCHAR(25)
);

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%sql SELECT name FROM sqlite_master WHERE type=='table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',),
 ('Worker',),
 ('Supervisor',)]

**Populating a table**

In [ ]:
%%sql INSERT INTO Worker (last_name,worker_id,first_name,salary,department) VALUES
('Arora',001,'Monika',1000000,'HR'),
('Kevin',002,'Sean',70000,'Admin');

In [ ]:
%%sql INSERT INTO Worker (last_name,worker_id,first_name,salary,department) VALUES
('Arora',001,'Monika',100000,'HR'),
('Kevin',002,'Sean',70000,'Admin'),
('Vishal',003,'Singh',50000,'Admin'),
('George',004,'Clooney',120000,'Accounts'),
('Mary',005,'Newton',90000,'Accounts');

 * sqlite:///chinook.db
5 rows affected.

[]

In [ ]:
%%sql SELECT * FROM Worker;

 * sqlite:///chinook.db
Done.

[('Arora', 1, 'Monika', 100000, 'HR'),
 ('Kevin', 2, 'Sean', 70000, 'Admin'),
 ('Vishal', 3, 'Singh', 50000, 'Admin'),
 ('George', 4, 'Clooney', 120000, 'Accounts'),
 ('Mary', 5, 'Newton', 90000, 'Accounts')]

In [ ]:
%%sql INSERT INTO Worker (last_name,worker_id,first_name,salary,department) VALUES
('Winnie','Jane',100000,'HR');

 * sqlite:///chinook.db
(sqlite3.OperationalError) 4 values for 5 columns
[SQL: INSERT INTO Worker (last_name,worker_id,first_name,salary,department) VALUES
('Winnie','Jane',100000,'HR');]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql INSERT INTO Worker (last_name,first_name,salary,department) VALUES
('Winnie','Jane',100000,'HR');

 * sqlite:///chinook.db
(sqlite3.IntegrityError) NOT NULL constraint failed: Worker.worker_id
[SQL: INSERT INTO Worker (last_name,first_name,salary,department) VALUES
('Winnie','Jane',100000,'HR');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
%%sql SELECT * FROM Worker;

 * sqlite:///chinook.db
Done.

[('Arora', 1, 'Monika', 100000, 'HR'),
 ('Kevin', 2, 'Sean', 70000, 'Admin'),
 ('Vishal', 3, 'Singh', 50000, 'Admin'),
 ('George', 4, 'Clooney', 120000, 'Accounts'),
 ('Mary', 5, 'Newton', 90000, 'Accounts')]

- Dropping tables

In [ ]:
%sql DROP TABLE Worker;

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql SELECT * FROM Worker;

 * sqlite:///chinook.db
(sqlite3.OperationalError) no such table: Worker
[SQL: SELECT * FROM Worker;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%sql select name from sqlite_master where type=='table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]